# Queries: Sakila(Core)
## Sarah Musselwhite
## 10/15/2022

In [3]:

import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

## Change username and password to match your personal MySQL Server settings
username = 'root' # default username for MySQL db is root
password = 'root' # whatever password you chose during MySQL installation.

connection = f'mysql+pymysql://{username}:{password}@localhost/sakila'
engine = create_engine(connection)

In [4]:
q = '''SHOW TABLES;'''
pd.read_sql(q,engine)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

In [19]:
"![png](C:\Users\Sarah\Downloads\sakila-db-model.png)"

SyntaxError: (unicode error) 'unicodeescape' codec can't decode bytes in position 9-10: truncated \UXXXXXXXX escape (409512325.py, line 1)

##### 1. What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [5]:
q = '''SELECT 
    cu.first_name, cu.last_name, cu.email, cu.address_id, c.city
FROM
    customer cu	
    CROSS JOIN 
    city c
    WHERE city_id = 312
    ORDER BY cu.first_name;  '''

In [6]:
pd.read_sql(q,engine)

,first_name,last_name,email,address_id,city
0,AARON,SELBY,AARON.SELBY@sakilacustomer.org,380,London
1,ADAM,GOOCH,ADAM.GOOCH@sakilacustomer.org,372,London
2,ADRIAN,CLARY,ADRIAN.CLARY@sakilacustomer.org,531,London
3,AGNES,BISHOP,AGNES.BISHOP@sakilacustomer.org,221,London
4,ALAN,KAHN,ALAN.KAHN@sakilacustomer.org,394,London
...,...,...,...,...,...
594,WILLIE,MARKHAM,WILLIE.MARKHAM@sakilacustomer.org,364,London
595,WILMA,RICHARDS,WILMA.RICHARDS@sakilacustomer.org,216,London
596,YOLANDA,WEAVER,YOLANDA.WEAVER@sakilacustomer.org,194,London
597,YVONNE,WATKINS,YVONNE.WATKINS@sakilacustomer.org,178,London
598,ZACHARY,HITE,ZACHARY.HITE@sakilacustomer.org,484,London

##### 2. What query would you run to get all comedy films? Note that the genre is called the category in this schema.  Your query should return film title, description, release year, rating, and special features.

In [7]:
q = ''' SELECT f.title, f.description, f.release_year, f.rating, f.special_features 
 FROM film f
 CROSS JOIN category c
 WHERE  c.name = 'Comedy'; 
        '''

In [8]:
pd.read_sql(q,engine)

,title,description,release_year,rating,special_features
0,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,PG,"Deleted Scenes,Behind the Scenes"
1,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,G,"Trailers,Deleted Scenes"
2,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,NC-17,"Trailers,Deleted Scenes"
3,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,G,"Commentaries,Behind the Scenes"
4,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,G,Deleted Scenes
...,...,...,...,...,...
995,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,G,"Trailers,Behind the Scenes"
996,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,NC-17,"Trailers,Behind the Scenes"
997,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,NC-17,Deleted Scenes
998,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,R,"Trailers,Deleted Scenes"
999,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,NC-17,"Trailers,Commentaries,Behind the Scenes"

##### 3. What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [9]:
q = ''' SELECT a.last_name, f.title, f.release_year
   FROM film f
   CROSS JOIN actor a 
   WHERE first_name = 'Johnny' AND last_name = 'Lollobrigida';'''

In [10]:
pd.read_sql(q,engine)

        last_name              title  release_year
0    LOLLOBRIGIDA   ACADEMY DINOSAUR          2006
1    LOLLOBRIGIDA     ACE GOLDFINGER          2006
2    LOLLOBRIGIDA   ADAPTATION HOLES          2006
3    LOLLOBRIGIDA   AFFAIR PREJUDICE          2006
4    LOLLOBRIGIDA        AFRICAN EGG          2006
..            ...                ...           ...
995  LOLLOBRIGIDA     YOUNG LANGUAGE          2006
996  LOLLOBRIGIDA         YOUTH KICK          2006
997  LOLLOBRIGIDA       ZHIVAGO CORE          2006
998  LOLLOBRIGIDA  ZOOLANDER FICTION          2006
999  LOLLOBRIGIDA          ZORRO ARK          2006

[1000 rows x 3 columns]

##### 4. What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [11]:
q = '''SELECT 
    a.first_name, a.last_name
FROM
    actor a
WHERE
    EXISTS( SELECT 
            *
        FROM
            film f
        WHERE
            f.title = 'Bingo Talented');
'''

In [12]:
pd.read_sql(q,engine)

    first_name     last_name
0     PENELOPE       GUINESS
1         NICK      WAHLBERG
2           ED         CHASE
3     JENNIFER         DAVIS
4       JOHNNY  LOLLOBRIGIDA
..         ...           ...
195       BELA        WALKEN
196      REESE          WEST
197       MARY        KEITEL
198      JULIA       FAWCETT
199      THORA        TEMPLE

[200 rows x 2 columns]

##### 5. What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

In [13]:
q = """SELECT customer_id, amount
FROM payment
WHERE amount > 2* (SELECT AVG(amount) FROM payment);"""

In [14]:
pd.read_sql(q,engine)

     customer_id  amount
0              1    9.99
1              2   10.99
2              3    8.99
3              3   10.99
4              3    8.99
..           ...     ...
852          595    9.99
853          595   10.99
854          597    8.99
855          599    9.99
856          599    8.99

[857 rows x 2 columns]

##### 6. What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

In [15]:
q = """SELECT customer.first_name, customer.last_name, COUNT(payment.customer_id)
FROM payment
JOIN customer ON customer.customer_id = payment.customer_id
GROUP BY payment.customer_id
ORDER BY COUNT(payment.customer_id) DESC
LIMIT 5;"""

In [16]:
pd.read_sql(q,engine)

  first_name last_name  COUNT(payment.customer_id)
0    ELEANOR      HUNT                          46
1       KARL      SEAL                          45
2     MARCIA      DEAN                          42
3      CLARA      SHAW                          42
4      TAMMY   SANDERS                          41